---
kind: type
id: T:Autodesk.Revit.DB.ConnectorGenderType
source: html/617658fc-73a1-99a4-7ce9-3663dcc2ffc8.htm
---
# Autodesk.Revit.DB.ConnectorGenderType

Connector gender type enum

## Syntax (C#)
```csharp
public enum ConnectorGenderType
```